Project/Toir.Adaptation/src/Documents/торо_АктПриемкиОборудования/торо_АктПриемкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктПриемкиОборудования</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8513385e-6034-419a-b807-16cbaf009992">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="80123eff-0995-47d5-8851-cacdb4ed1cc9">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗавершитьРемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f78c6d7a-513d-4172-acd6-67cd539553be">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6ebc082-5b34-4dc9-989e-5ceca388a781">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="93edf17a-e6e1-43b7-b637-bb7683198138">
    <name>РемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c026f7f3-9001-48e8-ae43-b6311afc572a">
      <name>Родитель_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="13c5222c-e72c-4deb-976b-ea5e71c2a76c">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5b155dad-268f-40a5-9cda-adf38b849861">
      <name>РемонтнаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="292545f4-3656-4274-98e7-6524e7005040">
      <name>НоваяОперация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1e00ed1-d007-48a1-a97c-9c09cb1af366">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bce66135-2c2d-4b02-9b24-1b4b257fc415">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6e222db4-48e2-41e6-b0db-be541d07402b">
    <name>МатериальныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="783b72be-3d92-47e1-83c1-f83e5d116bfb">
      <name>гкс_Давальческие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="305c47b2-824e-4796-a135-d4962b2f23d3">
    <name>ИсполнителиПоРемонтам</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b23ddd04-6d70-49d8-a27c-cf8169874579">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37d6bc6d-0833-419f-b341-b8dea598faf1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4c3bfad-e541-47e8-9005-fa8a9857cba5">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4a678fd-1266-4080-b919-06a2d79fae8a">
    <name>гкс_РежимРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe14a8d2-1944-4f1e-b299-7a9b0223ef28">
    <name>гкс_ОсобыеУсловия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41e7789d-5d85-460d-be8f-8fc2b293bbbd">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5e090819-3bf8-4a64-a7d2-0ab585ce4316">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="449da75b-fa30-4096-8fb8-e00acceca535">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d01a746a-1f60-452d-b092-1ead64a66198">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6a0ca5c1-fbd3-4c7e-bdde-3fb81c617b0a">
    <name>Исполнители</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c1ae9921-70cf-481b-885a-5b0ab42e254a">
      <name>гкс_ВремяРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0701d7e4-cb55-4f74-aab5-bcfc142200b6">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aa8b8405-de2a-40f9-abcf-463c138ba33a">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="64107450-ce42-48a3-b3d7-cdbfefb4f781">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="98f1156a-550e-4650-b792-f2b9616909e1">
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8aaffcc0-63ff-47b9-a8dd-73e848c02a69">
    <name>ИсполнителиПоРемонтам</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="189fe98f-02ff-434b-8b7f-6878c66dd57f">
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d0f7b50e-67c4-42a9-bec6-d0b463a7e599">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="45c58294-ca52-48e5-8e27-dc256cfa6f69">
    <name>Ответственные</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="81d9731d-7525-44cf-a76c-86ef23d1326c">
      <name>ОтветственноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aea61b3d-2bc1-41bd-8f3b-9930526732fe">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="84523221-6fd9-44b8-844b-b7c13eb9186f">
    <name>РемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a0d60cce-1bb8-48f6-90eb-d8a28e097c3e">
      <name>гкс_Огневая</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be7d6060-9f1e-428b-9ff8-f010677244f7">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="db8f9a67-aa24-4337-913e-55cf61e11ff6">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d4d1ad7a-8eb6-4821-b1b8-09da6816b24e">
      <name>РемонтнаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7cd36bfa-c12e-4642-be55-83b9067704c7">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_АктПриемкиОборудования/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура Расш_гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не Отказ Тогда 
		ИзменитьСтатусДефекта();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 17.03.2020
Процедура ИзменитьСтатусДефекта()
	ТекущаяСсылка = Неопределено;
	ТекущийПриоритет = 0;
	Для Каждого СТ Из ДокументыОснования Цикл
		Если ТипЗнч(Ст.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда 
			ТекущийПриоритет = 1;
			ТекущаяСсылка = Ст.ДокументОснование;
		ИначеЕсли ТипЗнч(Ст.ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда 
			ТекущийПриоритет = 2;
			ТекущаяСсылка = Ст.ДокументОснование;
		ИначеЕсли ТипЗнч(Ст.ДокументОснование) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда 
			ТекущийПриоритет = 3;
			ТекущаяСсылка = Ст.ДокументОснование;
		КонецЕсли;
	КонецЦикла;
	Если ТекущийПриоритет = 0 Тогда 
		Возврат;
	КонецЕсли;
	Если ТекущийПриоритет = 1 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ЗаявкаНаРемонтДокументыОснования.Ссылка КАК Заявка,
			|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование КАК Дефект
			|ПОМЕСТИТЬ Заявки
			|ИЗ
			|	Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
			|ГДЕ
			|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование = &Ссылка
			|	И торо_ЗаявкаНаРемонтДокументыОснования.Ссылка.гкс_НуженИспытание = ""Да""
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Заявки.Заявка КАК Заявка,
			|	Заявки.Дефект КАК Дефект,
			|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК Акт
			|ИЗ
			|	Заявки КАК Заявки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
			|		ПО Заявки.Заявка = торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование
			|			И (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.Проведен = ИСТИНА)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Заявки.Заявка,
			|	Заявки.Дефект,
			|	ОснованияАкта.Ссылка
			|ИЗ
			|	Заявки КАК Заявки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК ОснованияНаряда
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ОснованияАкта
			|			ПО ОснованияНаряда.Ссылка = ОснованияАкта.ДокументОснование
			|				И (ОснованияАкта.Ссылка.Проведен = ИСТИНА)
			|		ПО Заявки.Заявка = ОснованияНаряда.ДокументОснование";
	ИначеЕсли ТекущийПриоритет = 2 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК Акт
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
			|		ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""Да"")
			|			И (торо_ЗаявкаНаРемонт.Ссылка = &Ссылка)
			|			И (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.Проведен = ИСТИНА)
			|			И торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОснованияАкта.Ссылка
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ОснованияАкта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК ОснованияНаряда
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
			|			ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""Да"")
			|				И (торо_ЗаявкаНаРемонт.Ссылка = &Ссылка)
			|				И ОснованияНаряда.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
			|		ПО ОснованияАкта.ДокументОснование = ОснованияНаряда.Ссылка
			|			И (ОснованияАкта.Ссылка.Проведен = ИСТИНА)";
	ИначеЕсли ТекущийПриоритет = 3 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК Акт
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
			|		ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""Да"")
			|			И (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка = &Ссылка)
			|			И (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.Проведен = ИСТИНА)
			|			И торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОснованияАкта.Ссылка
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ОснованияАкта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК ОснованияНаряда
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
			|			ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""Да"")
			|				И ОснованияНаряда.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
			|		ПО ОснованияАкта.ДокументОснование = ОснованияНаряда.Ссылка
			|			И (ОснованияАкта.Ссылка = &Ссылка)
			|			И (ОснованияАкта.Ссылка.Проведен = ИСТИНА)";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", ТекущаяСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено и закомментировано:{
		//Если Выборка.Следующий() Тогда
		Пока Выборка.Следующий() Цикл
		// } Гкс-[TOIR20-537] Вялых Д.А. от 05.03.2025.
			торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Выборка.Акт);
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено и закомментировано:{	
		//КонецЕсли;
		КонецЦикла;
		// } Гкс-[TOIR20-537] Вялых Д.А. от 05.03.2025.
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		ДополнительныеСвойства.Вставить("ЭтоОтменаПроведения",Истина);
	КонецЕсли;
	// гкс+ [разработка 2021] Куст 28.04.2021
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		гкс_ПроверитьВозможностьВвода(Отказ);
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		гкс_ЗакрытьАкты();
	Иначе
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ Проведен = Ложь Тогда 
			гкс_ОтменитьЗакрытиеАктов();
		КонецЕсли;
	КонецЕсли;
	// гкс- [разработка 2021] Куст 28.04.2021
КонецПроцедуры

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Если Не Отказ И ДополнительныеСвойства.Свойство("ЭтоОтменаПроведения") Тогда 
		ИзменитьСтатусДефекта();
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 17.03.2020

// гкс+ [разработка 2021] Куст 28.04.2021
Процедура гкс_ЗакрытьАкты(Флаг = Истина)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ID КАК ИД
		|ПОМЕСТИТЬ НужныеРемонты
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Ссылка КАК Ссылка
		|ИЗ
		|	НужныеРемонты КАК НужныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ДокТЧ
		|		ПО НужныеРемонты.ИД = ДокТЧ.ID И ДокТЧ.Ссылка.Проведен = Истина
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокТЧ.Ссылка";
		
    ТаблицаРемонтов = РемонтыОборудования.Выгрузить(,"ID");
	ТаблицаРемонтов.Свернуть("ID");
	Запрос.УстановитьПараметр("ТЧ1", ТаблицаРемонтов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ЗавершитьРемонтныеРаботы = Флаг;
		Для Каждого СтрокаТаблицы ИЗ ДокОбъект.РемонтыОборудования Цикл
			СтрокаТаблицы.ЗавершитьРемонт = Флаг;
		КонецЦикла;
		ДокОбъект.БезусловнаяЗапись = Истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [разработка 2021] Куст 28.04.2021
Процедура гкс_ПроверитьВозможностьВвода(Отказ)
	Запрос = Новый Запрос;
	// гкс+ [] Деснол 10.10.2022
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ID КАК ИД
		|ПОМЕСТИТЬ НужныеРемонты
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК ДокТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НужныеРемонты КАК НужныеРемонты
		|		ПО ДокТЧ.ID = НужныеРемонты.ИД
		|			И (ДокТЧ.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|Где Не &Ссылка = ДокТЧ.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Ссылка КАК Ссылка, 
		|	Минимум(ДокТЧ.Ссылка.гкс_РаботыВыполнены) КАК гкс_РаботыВыполнены,
		|	ДокТЧ.Ссылка.СпособСогласования КАК Способ
		|	,РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус
		|Поместить ВТ_ТекущийСтатус
		|ИЗ
		|	НужныеРемонты КАК НужныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ДокТЧ
		|	Левое соединение РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов
		|	ПО РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = ДокТЧ.Ссылка
		|		ПО НужныеРемонты.ИД = ДокТЧ.ID И ДокТЧ.Ссылка.ПометкаУдаления = Ложь
		|Сгруппировать по ДокТЧ.Ссылка,
		|	ДокТЧ.Ссылка.СпособСогласования
		|	,РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента
		|;
		|Выбрать
		|ВТ.Ссылка КАК Ссылка,
		|ВТ.Статус КАК Статус,
		|ВТ.гкс_РаботыВыполнены КАК гкс_РаботыВыполнены,
		|ЕстьNULL(РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СогласованиеЗавершено, Ложь) КАК СогласованиеЗавершено
		|ИЗ ВТ_ТекущийСтатус КАК ВТ
		|Левое соединение  РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов
		|	ПО РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.Статус = ВТ.Статус
		|	И РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = ВТ.Способ
		|
		|
		|";
	// гкс- [] Деснол 10.10.2022
	Запрос.УстановитьПараметр("ТЧ1", РемонтыОборудования.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Пакет1 = 1;
	Пакет2 = Пакет1 + 2;
	Если РезультатЗапроса[Пакет1].Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса[Пакет1].Выбрать();
		Выборка.Следующий();
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='По ремонту уже есть акт приемки ';
		|en='Repair equipment acceptance certificate exists'") + Строка(Выборка.Ссылка);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	//
	Если РезультатЗапроса[Пакет2].Пустой() Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='По ремонту нет выполненных актов';
		|en='Repair equipment acceptance certificate exists'");
		Сообщение.Сообщить();
		Возврат;
	Иначе
		Выборка = РезультатЗапроса[Пакет2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.гкс_РаботыВыполнены = Ложь Тогда 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Не все акты по ремонту выполнены';
				|en='Repair equipment acceptance certificate exists'");
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			// гкс+ [] Деснол 24.08.2022
			Иначе
				Если Не ЗначениеЗаполнено(Выборка.Статус) 
					ИЛИ (Не Выборка.Статус = Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован
					И Не Выборка.СогласованиеЗавершено ) Тогда 
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = НСтр("ru='Не все акты по ремонту согласованы';
					|en='Repair equipment acceptance certificate exists'");
					Сообщение.Сообщить();
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			// гкс- [] Деснол 24.08.2022
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [разработка 2021] Куст 28.04.2021
Процедура гкс_ОтменитьЗакрытиеАктов()
	гкс_ЗакрытьАкты(Ложь);
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021
#КонецОбласти
